app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $cliente = new ClientesModel();
        $datos['datos']=$cliente->findAll();

INSERT INTO `clientes` (`cliente_id`, `nombre`, `apellido`, `nit`, `telefono`, `correo_electronico`, `direccion`, `contrasenia`) VALUES ('33', 'Nuevo', 'Prueba', '12345678912', '47002098', 'inventavo@gmail.com', '50av, Zona 6', 'fdfdfdf')
---
    public function agregarCliente()
    {
        $datos=[
            'cliente_id' => $this->request->getVar('txtClienteId'),
            'nombre' => $this->request->getVar('txtNombre'),
            'apellido' => $this->request->getVar('txtApellido'),
            'nit' => $this->request->getVar('txtNit'),
            'telefono' => $this->request->getVar('txtTelefono'),
            'correo_electronico' => $this->request->getVar('txtCorreo'),
            'direccion' => $this->request->getVar('txtDireccion'),
            'contrasenia' => $this->request->getVar('txtContra')
        ];
        //print_r($datos);
        $clientes = new ClientesModel();
        $clientes->insert($datos);

DELETE FROM `clientes`
WHERE `cliente_id` IN ('33')
---
    public function eliminarCliente($id=null)
    {
        $clientes = new ClientesModel();
        $clientes->delete(['cliente_id'=>$id]);

SELECT *
FROM `clientes`
WHERE `cliente_id` = '33'
 LIMIT 1
---
    public function buscarCliente($id=null){
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where('cliente_id',$id)->first();