app/Controllers/HotelesController.php

    public function index(): string
    {
        $hotel = new HotelesModel();
        $datos['datos']=$hotel->findAll();
---
SELECT *
FROM `hoteles`

    public function eliminarHotel($id=null){
        $hoteles = new HotelesModel();
        $hoteles->delete(['hotel_id'=>$id]);
---
DELETE FROM `hoteles`
WHERE `hotel_id` IN ('6')