app/Controllers/ReservacionesController.php

    public function index(): string
    {
        $reservacion = new ReservacionesModel();
        $datos['datos']=$reservacion->findAll();
---
SELECT *
FROM `reservaciones`

    public function eliminarReservacion($id=null)
    {
        $reservaciones = new ReservacionesModel();
        $detalle = new DetalleReservacionModel();
        $detalle->delete($id);
        $reservaciones->delete(['reservacion_id'=>$id]);
---
DELETE FROM `detalle_reservacion`
WHERE `reservacion_id` IN ('13')
DELETE FROM `reservaciones`
WHERE `reservacion_id` IN ('13')